
#### 1 данным методом пользуются редко
# file = open('text.txt', 'r', encoding='utf-8')
# # s = file.read()
# # s = file.readline() ###прочитать файл т.к. можно 1 раз-демонтсрировать его тоде можно 1 раз. поэтому ему нужно присвоить переменную (его содержимому-мы присвоили сейчас переменную с)
# # print(s)
# sl = file.readlines() ###readline читает одну строку и нужно повторять метод чтобы отображалось построчно, однако есть метод readlines он формирует нам список строк - где каждая строка имеет отдельный список
# print(sl)
# file.close()  ###если не указать, то информация с файла будет стерта

#### 2 (используется чаще) читает построчно файл (чтобы красиво отображалось нужно указать (i.rstrip())
# for i in open('text.txt', 'r', encoding='utf-8'):
#     print(i.rstrip())

#### 3 метод который будет использоваться чаще-постоянно
#### он выполняет построчное чтение(каждое слово в ковычках) + закрывает сам.
with open('text.txt', 'r', encoding='utf-8') as file:
    ls = file.read().title().split()


ls.sort()
print(ls)

####
with open('text1.txt', 'w', encoding='utf-8') as file:
    for n, f in enumerate(ls, 1):
        file.write(f'{n}. {f}\n')