##0 первые две строки ключ-значение и от них идет уже процесс
# d = {'name': 'Sany', 'age': 15, }
# d['school'] = 'fufy'

# ##3 перебрать (есть ли)  словать (все ключи).
# for i in d:
#     print(i)
# ##4 перебрать (есть ли) словарь (все значения)
# for i in d.values():
#     print(i)
# ##5 перебрать парами ключ-значение
# for k, v in d.items():
#     print(v, k)
##1 удаление значения
# del d['age']
# print(d)
##2 проверить есть ли ключ/значение
# if 'name' in d:
#     print('ключ "name", есть в словаре. ')
# else:
#     print('Ключа "name", нет в славоре. ')
##6 слияние словарей
d1 = {'name': 'Sany', 'age': 15, }
d2 = {'school': 'fufy', 'pet': 'Vivi'}
d1.update(d2)
print(d1)
