# """ кортеж (tuple) """
# """Кортеж - упорядоченный набор неизменяемых объектов пишится в круглых скобках"""
## его нельзя изменить, но все остальное можно как в списках.
##1
# tp = (22, 33, 44, 99)
# K = 7  , #запятая сразу переводит в кортеж. квадратные скобки - это список.
# print(K, type(K), K[0])
# type - это тип объекта (например: к-объект, 7-значение, класс-('tuple)
##если константа то большая будка К
##2
# tp = (22, 33, 44, 99)
# k, *i, z = 7, 5, 9, 10, 1, 36, 56 , 100 ##*распаковка сделала i коллекцией внутри кортежа
# print(k, i, z)

## распоковать кортеж/списки
num = [22, 33, 44, 55, 99]
for r, i in enumerate(num):
    print(i[0], i[1], end='   ')

## не относится к задаче выше_____
##что такое cnt? это счетчик перед циклом.
# cnt = 0 #счетчик перед цыклом
# for i in num: #это второй способ отобразить/узнать и индекс и значение
#     print(cnt, i, end='   ')
#     cnt += 1
# print()
## не относится к задаче выше______
# for k, i in zip(names, num): # зип берет значение из одного списка/кортежа и добавляет в другой
#     print(i)

##можно создать копию и перевести в список-изменив кортеж
# tp = ('login', 'password')
# print(tp, id(tp))
# buf = list(tp)
# buf[-1] = 'new_password'
# tp = tuple(buf)
# print(tp, id(tp))
