# ###переменные все типы, коллекции, циклы вайле и фор, ветвления,
# ###строки, списки, котеже, операторы, вложение циклов. множество, словори, функции.
# ### ф строки это строка формата, реализацию вывода в консоль или не консоль информации.
# from builtins import print
#
# n = 10
# m = 100
#
#
# print('первая переменная - "', n, '" вторая переменная - ', m,
#      ' m/n = "', m//n, '"', sep= '')
# ### sep - дает поставить ковычки ровно, без пробелов.
# print('первая переменная - "%d", вторая переменная - "%d", m/n = "%d"'%(n, m, m//n))
# ### "%d" - (буква "d", это значит что там будет целочисленное значени
# ### едает поставить ковычки ровно, без пробелов.
# print('первая переменная - "{}", вторая переменная - "{}", m/n = "{}"'. format(n, m, m//n))
# ### {} - дает поставить ковычки ровно - удобный.
# print(f'первая переменная - "{n}", вторая переменная - "{m}", m/n = "{m // n}"')
# ### {} - дает поставить ковычки ровно - самый удобный вариант.
# print(f'первая переменная - "{n}",\nвторая переменная - "{m}", \nm/n = "{m // n}"')
# ### \n - разделяет строку так, что бы после \n перенос шел на сл. строку.
# nn = f'первая переменная - "{n}", \nвторая переменная - "{m}", \nm/n = "{round(m / n, 2)}"'
# nn = f'первая переменная - "{n}", \nвторая переменная - "{m}", \nm/n = "{m / n:.2f}"'
# print(nn)
""" множество (set) неупорядочнных набор уникальных объектов"""
### 1)одинаковые объект в множестве не могут быть
###2) все объекты в множестве не по порядку (см. ниже). данные находятся в хеш таблице и
###3) именно как в хеш таблице объекты отображаются в консоле
###4)пустое множество выдаст нам "set()", пусток список "[]",пустой кортеж "()".
###2,3)
ls = [22, 22, 22, 33, 44]
st = set(ls)
print(st)
###4)
st.clear()
print(st)
###
st = {22, 33, 44}
print(st)
###любые типы неизменяемые могут быть объектами в множестве
###при добавление объект добавляется согласно хеш таблицы, мы место не можем выбрать.
#
# st.add(5)
# print(st)
# for i in st:
#     print(i)

### как добавить несколько значений?
### add - добавить одно значение
### update - добавить несколько
st.add(44)
st.update({11, 77})
print(st)

### 1) метод удаления в множестве, не известно какой
### элемент/объект удалили, только через принт увидим.
n = st.pop()
print(n)
### 2) для удаления конкретного элемента,объекта
### не известно есть ли элемент для удаления.
st.remove(77)
print(st)
### 3) метод удаляет опеделенный объект/элемент
### ищет этот объект в множестве.
st.discard(11)
print(st)

### объединение одного множества с другим
st1 = {2, 4, 88}
st2 = {2, 4, 45}
st3 = {2, 4}
# res = st1 + st2
#res = st1.union(st2) (выдало ошибку)
res = st1|st2 #(выдало ошибку)
print(res)

### пересечение множеств
# res = st1.intersection(st2) #(выдало ошибку)
res = st1 & st2
print(res)
### вычетание множеств
res = st1.difference(st2)
# res = st2 - st1
res = st1.symmetric_difference(st2) #из ст1 вычетается ст2,
### затем ст2 вычетается ст1 и оба сохраняются. и говорит какие элементы\объекты разные (лучший вариант)
print(res)
st1 = {2, 4, 88}
st2 = {2, 4, 45}
st3 = {2, 4} #подмножество первых двух множест
print(st3.issubset(st2))
print(st1.issubset(st3)) #супер множества (не понимаю)!!! у меня фолс почему???



