t = {
    'кот': 'cat', 'пес': 'dog',
    'книга': 'book', 'яблоко': 'apple',
    'солнце': 'sun', 'вода': 'water',
    'дерево': 'tree', 'цветок': 'flower',
    'машина': 'car', 'дом': 'house',
    'cat': 'кот', 'dog': 'пес',
    'book': 'книга', 'apple': 'яблоко',
    'sun': 'солнце', 'water': 'вода',
    'tree': 'дерево', 'flower': 'цветок',
    'car': 'машина', 'house': 'дом',
}
while True:
    try:
        w = input('введите слова: ')
        print(f"перевод слова '{w}' : '{t[w]}'")
    ##1) w-слово из t-словаря
    except KeyError:
        print('слово не найдено в словаре')