#### работа с файлами
"""сначала открываем файл
file = open ('file.txt', 'r')""" ###r - нужно указать что бы файл открывался для чтения(но если не указали то оно по умолчанию)
"""content = file.read() ###так мы читаем файл после открытия
file.write('новые данные') ###записать данные - похоже как применить значение переменной, но файл хранит их всегда,
 а переменная выключает. файл нужно закрывать команда 
 file.closw()-команда.
 полездно использовать конструкцию:
 with open('file.txt', 'r') as file:
 content = file.read()
 print(content)
 такая конструкция более надежная и закрытие писать не нужно будет"""
"""r=(read)-читать, w(write)-записать , a(append)-добавить
b=(binary)- в двоичном резиме wb, rb, + - открыть для чтения,
a+ - чтение и запись, создания, w+ - читать, записывать, перезаписывать"""

"""не читается-почему?"""
# try:
#     with open("БасняДураков.txt", encoding="utf-8") as file: ###кодровка использует команду (encoding="utf-8")
#         content = file.read() ####содержимое файла content
#         print(content)
#         # file.close() это теперь не нужно with сам и откроет и закроет
# except FileNotFoundError:
#         print("файл не найден")

"""кодировка текста"""
###utf-8 - (использует от 1 до 4 байт, совместим с ASCII, работает со всеми текстами)ооо то что мне говорил ИИ(пон, пон)
####windows-1251 - (использует 1 байт и только в OC windows, только кириллица)

try:
    with open ('pp','w', encoding="utf-8") as file:
        file.write("слово")
except FileNotFoundError:
    print('Файл не найден')
except IOError:
    print('Ошибка ввыода-вывода')
except EOFError:
    print('Ошибка - конец файла')
except UnicodeDecodeError:
    print('Ошибка кодирования')
except OSError:
    print('Ошибка ОС')
except Exception as e:
    print(f'неизвестная ошибка')