"""dict
неупорядочнный набор пар ключ:значение в которых ключ уникален
"""
###пустой словарь, пишится в фигурных скобках, выглядит так:
d = {}
###пример словаря:
d = {'Pb': 'свинец', 'Au': 'золото'}
###ключ:значение, при этом не может быть одинаковых пар (так же как в множестве)
###ключи будут уникальны, все переменные+кортеж все остальное сюда нельзя в словари.
###1)КАК мы достаем из словаря элементы? мы пишем ключ в принте и нам отображается элемент-значение.
print(d['Pb'])
###2) способ получения информации
### (если укажим не имеющийся ключ-получим ошибку) что бы не ошибиться есть спец. метод->
print(d.get('Au')) #если ключа нет то пишет none
print(d.get('Pb', 'my items'))
###3) КАК изменить значение? присвоить другое значение.(ниже)
d['Pb'] = 'Свинец'
print(d)
###1)способ добавления пары в словарь
d['Fe'] = 'Железо' #в словаре добавляется новый элимент.
print(d)
###2)способ (setdefault) запрещает присваивание других значений к существующим.
d.setdefault('Fe', '1000')
print(d)
###но добавляет ключ:элемент который еще нет
d.setdefault('H', 'кислород')
print(d)
###3)спомощью этого способа можно присвоить словать (несколько пар добавить)
###в этом способе меняется значение ключа
d.update({3: 33, 'H':'Кислород'})
print(d)
###1)метод удаления
n = d.pop('Fe')
###2)метод удаления и дабавления последней пары в словаре
nn = d.popitem()
print(nn)
###3)метод удаления. словарь послностью опустеет
# d.clear()

print(len(d)) #??? какие то сущности появляются две???
#1)
print(d.keys()) #показать только ключи
#2)
print(list(d)) #показать только ключи
#3)
for i in d:
    print(i) #ключи показались в столб
#1) показывает только значение
print(list(d.values()))
for v in d.values():
    print(v)
#2) показывает значение в виже строки - кортеж
print(list(d.items())) #список кортежей. ключ+значение.
#3) показывает ключ+значение в столб
for k, v in d.items():
    print(k, v)
###нельзя вовремя итераций, удалять итерироемые объекты
###из чистого списка мы словарь не сделаем, коллекция должна состоять из кортежа(пример ниже)
lst = [('Pb', 'Свинец'), ('Au', 'золото'), ('H', 'Кислород'), (11, 111)]
dd = dict(lst)  ##это тип данных «словарь». Это коллекция пар «ключ → значение».
print(dd)
###создаёт словарь из последовательности ключей с одинаковым значением для всех.
lst = [1, 2, 3]
dd = dict.fromkeys(lst, True)
print(dd)
#1) сформирование пары
dd = {i: i**2 for i in range(10, 20)} #индекс присвоили словарю? не понимаю.
print(dd)
#2)сформирование пары каждый раз (лесенкой) - хз не понимаю
dd = {}
for i in range(10, 20):
    dd[i] = i**2
    print(dd)