# ##1 пример - старым способом через for
# s = [] #сначала создаем пустой список
# for x in range(1, 10):
#     s.append(x**2) #добавим в список х и возведем его во вторую степень ** (в квадрат)
# print(s)
# ## 2 пример - выполняем в одну строчку ту же команду.
# s = [x**2 for x in range(1, 10) if x > 3] # for будет работать если выполняется условие if
# print(s)
# ## 3 по старому способу
# even = [] #четный список
# for x in range (1, 20):
#     if x % 2 == 0:
#         even.append(x)
# print(even)
# ## 4 по новому способу
# even = [x for x in range(1, 20) if x % 2 == 0]
# print(even)
# ## 5 тест старым способом (сделаем заглавными через команду аппер)
# words = ['яблока', 'груша', 'арбуз']
# up = []
# for x in words:
#     up.append(x.upper())
# print(up)
# ## 6 новым способом
# words = ['яблоко', 'груша', 'арбуз']
# up = [x.upper() for x in words]
# print(up)
# ## 7 программа для извлечения первога символа с первой строки (старый способ)
# words = ['яблоко', 'груша', 'арбуз']
# f = []
# for j in words:
#     f.append(j[0])
# print(f)
# ## 8 новым способом
# words = ['яблоко', 'груша', 'арбуз']
# f = [i [0] for i in words]
# print(f)
# ## 9
# words = ['яблоко', 'груша', 'арбуз', 'виноград', 'мандарин', 'малина']
# f = [len(i) for i in words]
# print(f)
# ## 10 перевести числа в строки
# n = [1, 3, 5, 6, 9, 12,14]
# f = [str(i) for i in n]
# print(f)
