###это под программа находящая в программе
###которая выполняется когда ее позовут. пофторяется столько раз сколько ее позовут
###начинается всегда с слова def.
def summator(a=10, b=4): #это называется процедура
    # print(a + b)
    return a * b #это команда, которая возвращает значение из функции и немедленно завершает её выполнение.
    # От английского "return" — «вернуть», «возвращаться».

#
# n = 45
# cc = 'qwerty'
# n = summator(2, 3) #позиционные аргументы, которые занимают одну позицию (что бл это???)
# # n = summator(2)
# print('функция', n) #это полноценная функция только если в ней есть return, если нет то не понятно можно ли ей пользоваться.
# # summator(2, 3) #аргумент передается имени функции.
# # summator(5, 10) #функции можно передавать разные аргументы и так получить разные ответы.
# print(summator(2))
# print(summator(b=8)) #ключевые аргументы ключ:значение
# ###1)иногда нам потребуется неограниченное кол-во аргументов или разные аргументы к 1-й фунции.
# ###все функции всегда пишутся вначале, между функциями пропускается всегда 2 строки.это правило!!!
def printing(*args, **kwargs):  ###это специальный параметр функции, который собирает все именованные аргументы в словарь.(что это бл....)
    print(args)
    print(kwargs)
    # return sum(args)
print(printing())
print(printing(1, 3, nn=16, y=45))  ###
printing('name1', 'name2', 'name3')
printing('name1', 'name2')
#######
# ##1
# #def sumr (a, y): ##локальные переменные которые пренадлежать только функции а есть глобальные которые пренадлежат модулю(типо покажи х, проверяем его нет, ищут тогда за пределами, если мы его запросим)
# #     global x
# #     z = 12
# #     z += 3
# #     print('X =', x, y, 'Z =', z)
# #     return a
# #
# #
# # z = 1000
# # x = 5000
# # res = sumr(10, 20)
# # print(res)
# # print('X =', x, 'Z =', z)
#
# ##2 анатация просто
# def is_eval(n:int) -> bool:
#     '''определяет четность числа. #докстрин многострочный комментарий
#     is_eval(2) -> True
#     is_eval(3) -> False'''
#
# #   pass
# # print(is_eval.__doc__)
#     return n % 2 == 0
# print(is_eval(2))
#
# # def choice_eval(x:int, y:int) -> None:
# #     """выбирает четные числа из последовательности"""
# #     for i in range(x, y + 1):
# #         if is_eval(i):
# #             print(i)
# # choice_eval(100, 140)
# #
# # for n in range(100, 200):
# #     for i in range (2, n):
# #         if n % i == 0:
# #             break
# #     else: #else цикла
# #         print(n, end=' ')
#
# #что значит функция вызывает сама себя? распечатать рекурсивно (пример с матрешками)
#
# # def num2(n:int)->None:
# #     if n > 1:
# #         num2(n - 1)
# #     print(n)
# # def num1(n:int)->None:
# #     if n > 1:
# #         num2(n - 1)
# #     print(n)
# #
# # def num(x, n: int) -> None:
# #     if n > x:
# #         num(x, n - 1)
# #     print(n)
# # num(2, 15)
# ##2)
# """
# 3! = 1 * 2 * 3 = 3 * 2!
# 2! = 1 * 2     = 2 * 1!
# 1! = 1
# n! = n * (n-1)!
# """
# def fact(n: int) -> int:
#     if n == 1:
#         return 1
#     else:
#         return n * fact(n-1)
# print(fact(6)) #пространственная ???
#
# ##3)
# def name(nm): ##есть функция. name - объект
#     cnt = 0 ##счетчик считает сколько раз был вызван объект
#     def surname(snm): ##функция в функции (процесс работает только если вызвать обе переменные-оба объекта)
#         nonlocal cnt ##nonlocal дает нам право не нашей переменной
#         cnt += 1
#         print(cnt, nm, snm)
#     return surname
#
#
# sur = name ('mary')
# sur('petrova')
# sur('oly')
# sur('kukucina')
# name('mary')('petrova')

##4)
