import random

from index import text

###пример 1 - (вывод чисел от 1 - 10)
# i = 1
# while i <= 10:
#     print(i)
#     i += 1

###пример 2 - (запров на ввод числа)
# n = 0
# while n <= 0:
#     n = int(input("Введите + число"))
# print(n)

###пример 3 - (проверка пароля (без учета ошибок)
# p = ""
# while p != "12345":
#     p = input("Введите пароль")
# print("Начинается выполнение входа.")

###привем 4 (угодай число)
# n = 7
# a = 0
# while a != n:
#     a = int(input("угадай число"))
# print(f"вы угодали {n}")

##привем 5 (угодай число случайное)
# n = random.randint(1,10)
# a = 0
# while a != n:
#     a = int(input("угадай число "))
# print(f"вы угодали {n}")

# ###привем 6 (требует ввод текста определенной длины)
# text = input("Введите текст минимум 10 символов: ")
# l = len(text)
# print(l)
# while len(text) < 10:
#     text = input("Неверный ввод: ")
# print(f"вы ввели текст '{text}'. его длина {l} символов.")

# ###привем 7 (бесконечный цикл) - увеличение на один называется инкрименция (мы инкримируем)
# i = 0
# while True:
#     print(i)
#     i += 1
# ###"""""инкримируем нашу переменную"""""
# ###"""""""""если добавим brack - """"
#     if i > 100:
#         break



